# 24-Aug-2021.  Pandas

In [68]:
import pandas as pd
import numpy as np

# Series

        
Tata    100
Birla   200
Wipro   300
Infy    400

In [69]:
mylist1 = [100,200,300,400]
ps1 = pd.Series(mylist1)
print(type(ps1))
ps1

<class 'pandas.core.series.Series'>

0    100
1    200
2    300
3    400
dtype: int64

In [70]:
ps1.index

RangeIndex(start=0, stop=4, step=1)

In [71]:
ps1.values

array([100, 200, 300, 400], dtype=int64)

In [72]:
print(type(ps1.values))

<class 'numpy.ndarray'>

In [73]:
ps1.ndim

1

In [74]:
ps1.shape

(4,)

In [75]:
ps1.count()

4

In [76]:
ps1.max()

400

In [77]:
ps1.min()

100

In [78]:
ps1.mean()

250.0

In [ ]:
ps1.median()

In [ ]:
ps1

In [ ]:
ps1[0]

In [ ]:
ps1[1:3]

In [ ]:
ps1[[0,3,1]]

In [ ]:
mylist1 = [100,200,300,400]
label_list = ['Tata', 'Birla', 'Wipro', 'Infy']

ps2 = pd.Series(mylist1, index=label_list, name='EmpCnt')
ps2

In [ ]:
ps2.index

In [ ]:
ps2['Tata']

In [ ]:
ps2[['Tata', 'Wipro', 'Birla']]

In [ ]:
ps2['Birla': 'Infy']

In [ ]:
## when you use, numerical slice, endpoint=False
## when you use label slice, endpoint=True

In [ ]:
md1 = {'Tata':100, 'Birla':200, 'Wipro':300, 'Infy':400}

In [ ]:
ps3 = pd.Series(md1)
ps3

In [ ]:
ps3.index

In [ ]:
ps3.values

In [ ]:
ps3

In [ ]:
ps3[ps3>200]

In [ ]:
ps3>200

In [ ]:
ps3.__name__ = 'EmpCnt'
ps3

In [ ]:
print(ps3)

# DataFrames

       Rev  Exp  HQ  EmpCnt
Tata   100  75   Mum  50
Birla  200  175  Kol  150
Wipro  300  275  Blr  250
Infy   400  375  Blr  350
MRF    500  475  Che  450

Creation using Lists

In [79]:
mylist1 = [
    
    [100,75,'Mum',50],
    [200,175,'Kol',150],
    [300,275,'Blr',250],
    [400,375,'Blr',350],
    [500,475,'Che',450]
   
]

row_label_list = ['Tata', 'Birla', 'Wipro', 'Infy', 'MRF']
col_label_list = ['Rev', 'Exp', 'HQ', 'EmpCnt']

In [80]:
df1 = pd.DataFrame(mylist1)
print(type(df1))
df1

<class 'pandas.core.frame.DataFrame'>

     0    1    2    3
0  100   75  Mum   50
1  200  175  Kol  150
2  300  275  Blr  250
3  400  375  Blr  350
4  500  475  Che  450

In [81]:
df1.index

RangeIndex(start=0, stop=5, step=1)

In [82]:
df1.columns

RangeIndex(start=0, stop=4, step=1)

In [83]:
df2 = pd.DataFrame(mylist1, index=row_label_list,  columns=col_label_list)
df2

       Rev  Exp   HQ  EmpCnt
Tata   100   75  Mum      50
Birla  200  175  Kol     150
Wipro  300  275  Blr     250
Infy   400  375  Blr     350
MRF    500  475  Che     450

In [84]:
df2.index

Index(['Tata', 'Birla', 'Wipro', 'Infy', 'MRF'], dtype='object')

In [85]:
df2.columns

Index(['Rev', 'Exp', 'HQ', 'EmpCnt'], dtype='object')

Creation using dict

In [86]:
df2

       Rev  Exp   HQ  EmpCnt
Tata   100   75  Mum      50
Birla  200  175  Kol     150
Wipro  300  275  Blr     250
Infy   400  375  Blr     350
MRF    500  475  Che     450

In [87]:
md2 = {
        'Rev': [100,200,300,400,500],
        'EmpCnt': [50,150,250,350,450],
        'Exp': [75,175,275,375,475],
        'HQ' : ['Mum','Kol','Blr','Blr','Che']
     
      }
row_label_list = ['Tata', 'Birla', 'Wipro', 'Infy', 'MRF']


df2 = pd.DataFrame(md2, index=row_label_list)
df2

       Rev  EmpCnt  Exp   HQ
Tata   100      50   75  Mum
Birla  200     150  175  Kol
Wipro  300     250  275  Blr
Infy   400     350  375  Blr
MRF    500     450  475  Che

In [90]:
df2.index

Index(['Tata', 'Birla', 'Wipro', 'Infy', 'MRF'], dtype='object')

In [91]:
df2.columns

Index(['Rev', 'EmpCnt', 'Exp', 'HQ'], dtype='object')

dataframe from CSV file

In [92]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bombay_Finance,899,917.0,674,Pub,1443,Mum,0,BFIN,Services,Apr 1925
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

# Attributes

In [93]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, Kolkata_FMCG to Indi_Services
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Vol      9 non-null      int64
 1   Rev      9 non-null      float64
 2   Exp      9 non-null      int64
 3   Sector   9 non-null      object
 4   EmpCnt   9 non-null      int64
 5   HQ       9 non-null      object
 6   MNC      9 non-null      int64
 7   StockID  9 non-null      object
 8   GST      9 non-null      object
 9   Started  9 non-null      object
dtypes: float64(1), int64(4), object(5)
memory usage: 792.0+ bytes

In [94]:
df1.describe()

              Vol         Rev         Exp        EmpCnt       MNC
count    9.000000    9.000000    9.000000      9.000000  9.000000
mean   940.444444  844.277778  666.333333   2469.333333  0.444444
std     31.460734   53.389788   90.689029   4006.439036  0.527046
min    899.000000  733.000000  605.000000    119.000000  0.000000
25%    925.000000  821.000000  609.000000   1154.000000  0.000000
50%    931.000000  863.200000  650.000000   1379.000000  0.000000
75%    966.000000  874.400000  674.000000   1656.000000  1.000000
max    992.000000  917.000000  895.000000  13023.000000  1.000000

In [95]:
df1.describe(include='object')

       Sector   HQ StockID       GST   Started
count       9    9       9         9         9
unique      3    5       9         2         9
top       Pub  NCR    KFMC  Services  Jan 1920
freq        5    2       1         6         1

In [96]:
df1.describe(include='all')

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
count,9.000000,9.000000,9.000000,9,9.000000,9,9.000000,9,9,9
unique,NaN,NaN,NaN,3,NaN,5,NaN,9,2,9
top,NaN,NaN,NaN,Pub,NaN,NCR,NaN,KFMC,Services,Jan 1920
freq,NaN,NaN,NaN,5,NaN,2,NaN,1,6,1
mean,940.444444,844.277778,666.333333,NaN,2469.333333,NaN,0.444444,NaN,NaN,NaN
std,31.460734,53.389788,90.689029,NaN,4006.439036,NaN,0.527046,NaN,NaN,NaN
min,899.000000,733.000000,605.000000,NaN,119.000000,NaN,0.000000,NaN,NaN,NaN
25%,925.000000,821.000000,609.000000,NaN,1154.000000,NaN,0.000000,NaN,NaN,NaN
50%,931.000000,863.200000,650.000000,NaN,1379.000000,NaN,0.000000,NaN,NaN,NaN
75%,966.000000,874.400000,674.000000,NaN,1656.000000,NaN,1.000000,NaN,NaN,NaN
max,992.000000,917.000000,895.000000,NaN,13023.000000,NaN,1.000000,NaN,NaN,NaN

In [97]:
print(type(np.NaN))

<class 'float'>

In [98]:
import numpy as np

In [99]:
df1.shape

(9, 10)

In [100]:
df1.values

array([[925, 874.4, 676, 'Pub', 1379, 'Kol', 1, 'KFMC', 'Goods',
        'Jan 1920'],
       [931, 863.5, 605, 'Pub', 1935, 'NCR', 0, 'NCRL', 'Services',
        'Feb 1960'],
       [931, 839.8, 615, 'Pvt', 154, 'Mum', 0, 'SPRT', 'Services',
        'Mar 1943'],
       [899, 917.0, 674, 'Pub', 1443, 'Mum', 0, 'BFIN', 'Services',
        'Apr 1925'],
       [900, 881.6, 650, 'Gov', 1361, 'Blr', 0, 'BSYS', 'Services',
        'Apr 1950'],
       [992, 821.0, 665, 'Pub', 1154, 'Che', 1, 'SHIP', 'Services',
        'Nov 1930'],
       [966, 805.0, 895, 'Pvt', 119, 'Blr', 1, 'BREW', 'Goods',
        'Oct 1971'],
       [966, 863.2, 608, 'Pub', 1656, 'Che', 1, 'CHEM', 'Goods',
        'Aug 1928'],
       [954, 733.0, 609, 'Gov', 13023, 'NCR', 0, 'INDI', 'Services',
        'Mar 1920']], dtype=object)

In [101]:
df1.index

Index(['Kolkata_FMCG', 'NCR_Leagles', 'Bombay_Sporting', 'Bombay_Finance',
       'Bangalore_Systems', 'Chennai_Shipping', 'Bangalore_Breweries',
       'Chennai_Chemicals', 'Indi_Services'],
      dtype='object')

In [102]:
df1.columns

Index(['Vol', 'Rev', 'Exp', 'Sector', 'EmpCnt', 'HQ', 'MNC', 'StockID', 'GST',
       'Started'],
      dtype='object')

In [103]:
df1.head()

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bombay_Finance,899,917.0,674,Pub,1443,Mum,0,BFIN,Services,Apr 1925
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950

In [104]:
df1.head(3)

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943

In [105]:
df1.tail()

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

In [106]:
df1.count()

Vol        9
Rev        9
Exp        9
Sector     9
EmpCnt     9
HQ         9
MNC        9
StockID    9
GST        9
Started    9
dtype: int64

In [107]:
x = df1.max()
print(type(x))
x

<class 'pandas.core.series.Series'>

Vol             992
Rev           917.0
Exp             895
Sector          Pvt
EmpCnt        13023
HQ              NCR
MNC               1
StockID        SPRT
GST        Services
Started    Oct 1971
dtype: object

In [108]:
df1.min()

Vol             899
Rev           733.0
Exp             605
Sector          Gov
EmpCnt          119
HQ              Blr
MNC               0
StockID        BFIN
GST           Goods
Started    Apr 1925
dtype: object

In [109]:
df1.mean()

C:\Users\dhili\AppData\Local\Temp\ipykernel_28184\2053335143.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.mean()

Vol        940.444444
Rev        844.277778
Exp        666.333333
EmpCnt    2469.333333
MNC          0.444444
dtype: float64

In [110]:
df1.shape

(9, 10)

In [111]:
print(df1)

                     Vol    Rev  Exp Sector  EmpCnt   HQ  MNC StockID  \
Kolkata_FMCG         925  874.4  676    Pub    1379  Kol    1    KFMC
NCR_Leagles          931  863.5  605    Pub    1935  NCR    0    NCRL
Bombay_Sporting      931  839.8  615    Pvt     154  Mum    0    SPRT
Bombay_Finance       899  917.0  674    Pub    1443  Mum    0    BFIN
Bangalore_Systems    900  881.6  650    Gov    1361  Blr    0    BSYS
Chennai_Shipping     992  821.0  665    Pub    1154  Che    1    SHIP
Bangalore_Breweries  966  805.0  895    Pvt     119  Blr    1    BREW
Chennai_Chemicals    966  863.2  608    Pub    1656  Che    1    CHEM
Indi_Services        954  733.0  609    Gov   13023  NCR    0    INDI

                          GST   Started
Kolkata_FMCG            Goods  Jan 1920
NCR_Leagles          Services  Feb 1960
Bombay_Sporting      Services  Mar 1943
Bombay_Finance       Services  Apr 1925
Bangalore_Systems    Services  Apr 1950
Chennai_Shipping     Services  Nov 1930
Bangalore_Breweries     Goods  Oct 1971
Chennai_Chemicals       Goods  Aug 1928
Indi_Services        Services  Mar 1920

# Access of DataFrames

In [112]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bombay_Finance,899,917.0,674,Pub,1443,Mum,0,BFIN,Services,Apr 1925
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

In [113]:
x = df1['Rev']
print(type(x))
x

<class 'pandas.core.series.Series'>

Kolkata_FMCG           874.4
NCR_Leagles            863.5
Bombay_Sporting        839.8
Bombay_Finance         917.0
Bangalore_Systems      881.6
Chennai_Shipping       821.0
Bangalore_Breweries    805.0
Chennai_Chemicals      863.2
Indi_Services          733.0
Name: Rev, dtype: float64

In [114]:
df1.Rev

Kolkata_FMCG           874.4
NCR_Leagles            863.5
Bombay_Sporting        839.8
Bombay_Finance         917.0
Bangalore_Systems      881.6
Chennai_Shipping       821.0
Bangalore_Breweries    805.0
Chennai_Chemicals      863.2
Indi_Services          733.0
Name: Rev, dtype: float64

In [ ]:
df1['Bombay_Sporting']  ##  Error

In [115]:
df1[ ['Rev', 'HQ']  ]

                       Rev   HQ
Kolkata_FMCG         874.4  Kol
NCR_Leagles          863.5  NCR
Bombay_Sporting      839.8  Mum
Bombay_Finance       917.0  Mum
Bangalore_Systems    881.6  Blr
Chennai_Shipping     821.0  Che
Bangalore_Breweries  805.0  Blr
Chennai_Chemicals    863.2  Che
Indi_Services        733.0  NCR

In [116]:
df1[ ['Bombay_Sporting','Chennai_Shipping']   ]

KeyError: "None of [Index(['Bombay_Sporting', 'Chennai_Shipping'], dtype='object')] are in the [columns]"

In [117]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bombay_Finance,899,917.0,674,Pub,1443,Mum,0,BFIN,Services,Apr 1925
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

In [118]:
df1[ 'Bombay_Sporting': 'Bangalore_Breweries' :2 ]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971

In [119]:
df1[ 'Chennai_Shipping': 'Chennai_Shipping' ]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930

In [120]:
df1[ 'Rev': 'HQ' ]

KeyError: 'Rev'

In [ ]:
df1

In [121]:
df1['NCR_Leagles':'NCR_Leagles']['EmpCnt']

NCR_Leagles    1935
Name: EmpCnt, dtype: int64

In [122]:
df1['EmpCnt']['NCR_Leagles']

1935

Integer location based access

In [123]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bombay_Finance,899,917.0,674,Pub,1443,Mum,0,BFIN,Services,Apr 1925
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

In [124]:
df1.iloc[0]

Vol             925
Rev           874.4
Exp             676
Sector          Pub
EmpCnt         1379
HQ              Kol
MNC               1
StockID        KFMC
GST           Goods
Started    Jan 1920
Name: Kolkata_FMCG, dtype: object

In [125]:
df1.iloc[0,0]

925

In [ ]:
df1.iloc['Kolkata_FMCG']   ## Error

In [ ]:
df1

In [126]:
df1.iloc[2:8:2]  ##  2:8:2  2,4,6,   ####  8,10,12...

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971

In [127]:
df1.iloc[2:7,  2:5]

                     Exp Sector  EmpCnt
Bombay_Sporting      615    Pvt     154
Bombay_Finance       674    Pub    1443
Bangalore_Systems    650    Gov    1361
Chennai_Shipping     665    Pub    1154
Bangalore_Breweries  895    Pvt     119

In [ ]:
df1

In [128]:
df1.iloc[  [1,2,-3,-1]  ]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

In [130]:
df1.iloc[ [1,2,-3,-1],  [1,2,5,-2,-1]  ]

                       Rev  Exp   HQ       GST   Started
NCR_Leagles          863.5  605  NCR  Services  Feb 1960
Bombay_Sporting      839.8  615  Mum  Services  Mar 1943
Bangalore_Breweries  805.0  895  Blr     Goods  Oct 1971
Indi_Services        733.0  609  NCR  Services  Mar 1920

In [131]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bombay_Finance,899,917.0,674,Pub,1443,Mum,0,BFIN,Services,Apr 1925
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

In [132]:
df1.iloc[ : ,  [4,5]]

                     EmpCnt   HQ
Kolkata_FMCG           1379  Kol
NCR_Leagles            1935  NCR
Bombay_Sporting         154  Mum
Bombay_Finance         1443  Mum
Bangalore_Systems      1361  Blr
Chennai_Shipping       1154  Che
Bangalore_Breweries     119  Blr
Chennai_Chemicals      1656  Che
Indi_Services         13023  NCR

Label based Access

In [ ]:
df1

In [ ]:
df1.loc[0]  ##  Error

In [133]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bombay_Finance,899,917.0,674,Pub,1443,Mum,0,BFIN,Services,Apr 1925
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

In [134]:
df1.loc['Bombay_Finance']

Vol             899
Rev           917.0
Exp             674
Sector          Pub
EmpCnt         1443
HQ              Mum
MNC               0
StockID        BFIN
GST        Services
Started    Apr 1925
Name: Bombay_Finance, dtype: object

In [135]:
df1.loc['Bombay_Finance', 'HQ']

'Mum'

In [136]:
df1.loc['Bombay_Sporting':'Chennai_Chemicals':2 ]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971

In [137]:
df1.loc['Bombay_Sporting':'Chennai_Chemicals':2 ,   'Rev':'MNC']

                       Rev  Exp Sector  EmpCnt   HQ  MNC
Bombay_Sporting      839.8  615    Pvt     154  Mum    0
Bangalore_Systems    881.6  650    Gov    1361  Blr    0
Bangalore_Breweries  805.0  895    Pvt     119  Blr    1

In [138]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bombay_Finance,899,917.0,674,Pub,1443,Mum,0,BFIN,Services,Apr 1925
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

In [139]:
df1.loc[  ['NCR_Leagles', 'Bombay_Sporting', 'Chennai_Chemicals','Indi_Services' ] ]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

In [140]:
df1.loc[  ['NCR_Leagles', 'Bombay_Sporting', 'Chennai_Chemicals','Indi_Services' ],  ['Vol','GST','HQ'] ]

                   Vol       GST   HQ
NCR_Leagles        931  Services  NCR
Bombay_Sporting    931  Services  Mum
Chennai_Chemicals  966     Goods  Che
Indi_Services      954  Services  NCR

In [ ]:
df1

In [141]:
df1.loc[ : , ['EmpCnt','HQ']]

                     EmpCnt   HQ
Kolkata_FMCG           1379  Kol
NCR_Leagles            1935  NCR
Bombay_Sporting         154  Mum
Bombay_Finance         1443  Mum
Bangalore_Systems      1361  Blr
Chennai_Shipping       1154  Che
Bangalore_Breweries     119  Blr
Chennai_Chemicals      1656  Che
Indi_Services         13023  NCR

In [142]:
df1.loc[ 'Bangalore_Systems' , ['EmpCnt','HQ']]

EmpCnt    1361
HQ         Blr
Name: Bangalore_Systems, dtype: object

#Grammer

Direct Access
integer index based Access
label based Access
********

Direct Access:

    df1[<col_name_only>]  or df1.col_name

    df1[ [list of col names only] ] 

    df1[ row_name_only_slice ]

********
integer index based Access

    df1.iloc[row_n_index]
    df1.iloc[row_n_index, col_n_index]
    
    df1.iloc[row_n_slice]
    df1.iloc[row_n_slice, col_n_slice]
    
    df1.iloc[ [list of row_n_indices]  ]
    df1.iloc[ [list of row_n_indices] ,  [list of col_n_indices]  ]


    ##combo of above

********
Label   based Access
    df1.loc[row_label]
    df1.loc[row_label, col_label]
    
    df1.loc[row_label_slice]
    df1.loc[row_label_slice, col_label_slice]
    
    df1.loc[ [list of row_labels]  ]
    df1.loc[ [list of row_labels] ,  [list of col_labels]  ]
    
    ## combo of above
    
    
********
Conditional Access

   df1[condition]  or    df1.loc[condition]
   
   df1.loc[condition, column_label]

In [ ]:
df1.loc[ 'Bombay_Finance':'Chennai_Chemicals' ,  'Vol':'HQ' ]

Conditional Access

In [ ]:
df1

In [ ]:
mask = df1.Vol > 925
mask

In [ ]:
df1[mask]

In [ ]:
df1[df1.Vol > 925]

In [143]:
df1[  (df1.Vol > 925) & (df1.Sector=='Pub')]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928

In [ ]:
df1

In [ ]:
df1.Vol.max()

In [144]:
df1[df1.Vol == df1.Vol.max()]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930

In [145]:
df1.Vol.mean()

940.4444444444445

In [146]:
df1[df1.Vol >= df1.Vol.mean()]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

In [149]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bombay_Finance,899,917.0,674,Pub,1443,Mum,0,BFIN,Services,Apr 1925
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

In [147]:
df1.GST.count()

9

In [148]:
df1.GST.value_counts()

Services    6
Goods       3
Name: GST, dtype: int64

In [ ]:
## give the empcnt of all services companies

In [150]:
df1[df1.GST == 'Services'][ 'EmpCnt']

NCR_Leagles           1935
Bombay_Sporting        154
Bombay_Finance        1443
Bangalore_Systems     1361
Chennai_Shipping      1154
Indi_Services        13023
Name: EmpCnt, dtype: int64

In [151]:
df1.loc[ df1.GST == 'Services', 'EmpCnt' ]

NCR_Leagles           1935
Bombay_Sporting        154
Bombay_Finance        1443
Bangalore_Systems     1361
Chennai_Shipping      1154
Indi_Services        13023
Name: EmpCnt, dtype: int64

Mutability

In [ ]:
df1

In [ ]:
df1.loc['Bombay_Sporting', 'EmpCnt'] = 999

In [ ]:
df1

In [ ]:
df1.loc[df1.Vol > 925]

In [ ]:
df1.loc[df1.Vol > 925, 'Vol']

In [ ]:
df1.loc[df1.Vol > 925, 'Vol'] = 999

In [ ]:
df1

In [ ]:
df1['Profits'] = df1.Rev - df1.Exp
df1

In [ ]:
df1

In [152]:
df1.loc[df1.Vol > 900,  ['Rev', 'EmpCnt', 'HQ'] ]

                       Rev  EmpCnt   HQ
Kolkata_FMCG         874.4    1379  Kol
NCR_Leagles          863.5    1935  NCR
Bombay_Sporting      839.8     154  Mum
Chennai_Shipping     821.0    1154  Che
Bangalore_Breweries  805.0     119  Blr
Chennai_Chemicals    863.2    1656  Che
Indi_Services        733.0   13023  NCR

In [153]:
df1.loc[(df1.Vol > 900) & (df1.Rev > 800),  ['Rev', 'EmpCnt', 'HQ'] ]

                       Rev  EmpCnt   HQ
Kolkata_FMCG         874.4    1379  Kol
NCR_Leagles          863.5    1935  NCR
Bombay_Sporting      839.8     154  Mum
Chennai_Shipping     821.0    1154  Che
Bangalore_Breweries  805.0     119  Blr
Chennai_Chemicals    863.2    1656  Che

In [154]:
df1.loc[np.logical_and(df1.Vol>900, df1.Rev>800),  ['Rev', 'EmpCnt', 'HQ', 'GST'] ]

                       Rev  EmpCnt   HQ       GST
Kolkata_FMCG         874.4    1379  Kol     Goods
NCR_Leagles          863.5    1935  NCR  Services
Bombay_Sporting      839.8     154  Mum  Services
Chennai_Shipping     821.0    1154  Che  Services
Bangalore_Breweries  805.0     119  Blr     Goods
Chennai_Chemicals    863.2    1656  Che     Goods

In [155]:
df1.loc[np.logical_and(df1.Vol>900, df1.Rev>800),  ['Rev', 'EmpCnt', 'HQ', 'GST'] ]

                       Rev  EmpCnt   HQ       GST
Kolkata_FMCG         874.4    1379  Kol     Goods
NCR_Leagles          863.5    1935  NCR  Services
Bombay_Sporting      839.8     154  Mum  Services
Chennai_Shipping     821.0    1154  Che  Services
Bangalore_Breweries  805.0     119  Blr     Goods
Chennai_Chemicals    863.2    1656  Che     Goods

In [156]:
df1.loc[(df1.Vol > 900) & (df1.Rev > 800) & (df1.GST == 'Services' ),  ['Rev', 'EmpCnt', 'HQ','GST'] ]

                    Rev  EmpCnt   HQ       GST
NCR_Leagles       863.5    1935  NCR  Services
Bombay_Sporting   839.8     154  Mum  Services
Chennai_Shipping  821.0    1154  Che  Services

In [ ]:
### np.logical_and.reduce

# Sorting

In [157]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943
Bombay_Finance,899,917.0,674,Pub,1443,Mum,0,BFIN,Services,Apr 1925
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920

0sort by labels

In [158]:
pd.set_option('display.width', 100)

In [159]:
df2 = df1.sort_index(axis=0, ascending=True, inplace=True)
print(df2)
print()
print(df1)

None

                     Vol    Rev  Exp Sector  EmpCnt   HQ  MNC StockID       GST   Started
Bangalore_Breweries  966  805.0  895    Pvt     119  Blr    1    BREW     Goods  Oct 1971
Bangalore_Systems    900  881.6  650    Gov    1361  Blr    0    BSYS  Services  Apr 1950
Bombay_Finance       899  917.0  674    Pub    1443  Mum    0    BFIN  Services  Apr 1925
Bombay_Sporting      931  839.8  615    Pvt     154  Mum    0    SPRT  Services  Mar 1943
Chennai_Chemicals    966  863.2  608    Pub    1656  Che    1    CHEM     Goods  Aug 1928
Chennai_Shipping     992  821.0  665    Pub    1154  Che    1    SHIP  Services  Nov 1930
Indi_Services        954  733.0  609    Gov   13023  NCR    0    INDI  Services  Mar 1920
Kolkata_FMCG         925  874.4  676    Pub    1379  Kol    1    KFMC     Goods  Jan 1920
NCR_Leagles          931  863.5  605    Pub    1935  NCR    0    NCRL  Services  Feb 1960

In [160]:
df2 = df1.sort_index(axis=0, ascending=True, inplace=False)
print(df2)
print()
print(df1)

                     Vol    Rev  Exp Sector  EmpCnt   HQ  MNC StockID       GST   Started
Bangalore_Breweries  966  805.0  895    Pvt     119  Blr    1    BREW     Goods  Oct 1971
Bangalore_Systems    900  881.6  650    Gov    1361  Blr    0    BSYS  Services  Apr 1950
Bombay_Finance       899  917.0  674    Pub    1443  Mum    0    BFIN  Services  Apr 1925
Bombay_Sporting      931  839.8  615    Pvt     154  Mum    0    SPRT  Services  Mar 1943
Chennai_Chemicals    966  863.2  608    Pub    1656  Che    1    CHEM     Goods  Aug 1928
Chennai_Shipping     992  821.0  665    Pub    1154  Che    1    SHIP  Services  Nov 1930
Indi_Services        954  733.0  609    Gov   13023  NCR    0    INDI  Services  Mar 1920
Kolkata_FMCG         925  874.4  676    Pub    1379  Kol    1    KFMC     Goods  Jan 1920
NCR_Leagles          931  863.5  605    Pub    1935  NCR    0    NCRL  Services  Feb 1960

                     Vol    Rev  Exp Sector  EmpCnt   HQ  MNC StockID       GST   Started
Bangalore_Breweries  966  805.0  895    Pvt     119  Blr    1    BREW     Goods  Oct 1971
Bangalore_Systems    900  881.6  650    Gov    1361  Blr    0    BSYS  Services  Apr 1950
Bombay_Finance       899  917.0  674    Pub    1443  Mum    0    BFIN  Services  Apr 1925
Bombay_Sporting      931  839.8  615    Pvt     154  Mum    0    SPRT  Services  Mar 1943
Chennai_Chemicals    966  863.2  608    Pub    1656  Che    1    CHEM     Goods  Aug 1928
Chennai_Shipping     992  821.0  665    Pub    1154  Che    1    SHIP  Services  Nov 1930
Indi_Services        954  733.0  609    Gov   13023  NCR    0    INDI  Services  Mar 1920
Kolkata_FMCG         925  874.4  676    Pub    1379  Kol    1    KFMC     Goods  Jan 1920
NCR_Leagles          931  863.5  605    Pub    1935  NCR    0    NCRL  Services  Feb 1960

In [161]:
mylist1 = list('python')
print(mylist1)
x = mylist1.append('hello')
print(x)
print(mylist1)

['p', 'y', 't', 'h', 'o', 'n']
None
['p', 'y', 't', 'h', 'o', 'n', 'hello']

In [162]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

                     Vol    Rev  Exp Sector  EmpCnt   HQ  MNC StockID       GST   Started
Kolkata_FMCG         925  874.4  676    Pub    1379  Kol    1    KFMC     Goods  Jan 1920
NCR_Leagles          931  863.5  605    Pub    1935  NCR    0    NCRL  Services  Feb 1960
Bombay_Sporting      931  839.8  615    Pvt     154  Mum    0    SPRT  Services  Mar 1943
Bombay_Finance       899  917.0  674    Pub    1443  Mum    0    BFIN  Services  Apr 1925
Bangalore_Systems    900  881.6  650    Gov    1361  Blr    0    BSYS  Services  Apr 1950
Chennai_Shipping     992  821.0  665    Pub    1154  Che    1    SHIP  Services  Nov 1930
Bangalore_Breweries  966  805.0  895    Pvt     119  Blr    1    BREW     Goods  Oct 1971
Chennai_Chemicals    966  863.2  608    Pub    1656  Che    1    CHEM     Goods  Aug 1928
Indi_Services        954  733.0  609    Gov   13023  NCR    0    INDI  Services  Mar 1920

In [163]:
df2 = df1.sort_index(axis=0, ascending=False, inplace=False)
print(df2)

                     Vol    Rev  Exp Sector  EmpCnt   HQ  MNC StockID       GST   Started
NCR_Leagles          931  863.5  605    Pub    1935  NCR    0    NCRL  Services  Feb 1960
Kolkata_FMCG         925  874.4  676    Pub    1379  Kol    1    KFMC     Goods  Jan 1920
Indi_Services        954  733.0  609    Gov   13023  NCR    0    INDI  Services  Mar 1920
Chennai_Shipping     992  821.0  665    Pub    1154  Che    1    SHIP  Services  Nov 1930
Chennai_Chemicals    966  863.2  608    Pub    1656  Che    1    CHEM     Goods  Aug 1928
Bombay_Sporting      931  839.8  615    Pvt     154  Mum    0    SPRT  Services  Mar 1943
Bombay_Finance       899  917.0  674    Pub    1443  Mum    0    BFIN  Services  Apr 1925
Bangalore_Systems    900  881.6  650    Gov    1361  Blr    0    BSYS  Services  Apr 1950
Bangalore_Breweries  966  805.0  895    Pvt     119  Blr    1    BREW     Goods  Oct 1971

In [ ]:
df2 = df1.sort_index(axis=1, ascending=False, inplace=False)
print(df2)

In [ ]:
df2 = df1.sort_index(axis=1, ascending=True, inplace=False)
print(df2)

In [164]:
df2 = df1.sort_index(axis=0, ascending=True, inplace=False).sort_index(axis=1, ascending=True, inplace=False)
df2

                     EmpCnt  Exp       GST   HQ  MNC    Rev Sector   Started StockID  Vol
Bangalore_Breweries     119  895     Goods  Blr    1  805.0    Pvt  Oct 1971    BREW  966
Bangalore_Systems      1361  650  Services  Blr    0  881.6    Gov  Apr 1950    BSYS  900
Bombay_Finance         1443  674  Services  Mum    0  917.0    Pub  Apr 1925    BFIN  899
Bombay_Sporting         154  615  Services  Mum    0  839.8    Pvt  Mar 1943    SPRT  931
Chennai_Chemicals      1656  608     Goods  Che    1  863.2    Pub  Aug 1928    CHEM  966
Chennai_Shipping       1154  665  Services  Che    1  821.0    Pub  Nov 1930    SHIP  992
Indi_Services         13023  609  Services  NCR    0  733.0    Gov  Mar 1920    INDI  954
Kolkata_FMCG           1379  676     Goods  Kol    1  874.4    Pub  Jan 1920    KFMC  925
NCR_Leagles            1935  605  Services  NCR    0  863.5    Pub  Feb 1960    NCRL  931

sort by values

In [165]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

                     Vol    Rev  Exp Sector  EmpCnt   HQ  MNC StockID       GST   Started
Kolkata_FMCG         925  874.4  676    Pub    1379  Kol    1    KFMC     Goods  Jan 1920
NCR_Leagles          931  863.5  605    Pub    1935  NCR    0    NCRL  Services  Feb 1960
Bombay_Sporting      931  839.8  615    Pvt     154  Mum    0    SPRT  Services  Mar 1943
Bombay_Finance       899  917.0  674    Pub    1443  Mum    0    BFIN  Services  Apr 1925
Bangalore_Systems    900  881.6  650    Gov    1361  Blr    0    BSYS  Services  Apr 1950
Chennai_Shipping     992  821.0  665    Pub    1154  Che    1    SHIP  Services  Nov 1930
Bangalore_Breweries  966  805.0  895    Pvt     119  Blr    1    BREW     Goods  Oct 1971
Chennai_Chemicals    966  863.2  608    Pub    1656  Che    1    CHEM     Goods  Aug 1928
Indi_Services        954  733.0  609    Gov   13023  NCR    0    INDI  Services  Mar 1920

In [ ]:
df2 = df1.sort_values(by='Vol', axis=0, ascending=True, inplace=False)
df2

In [ ]:
df2 = df1.sort_values(by=['Vol','Rev'] , axis=0, ascending=[True,True],  inplace=False)
df2

In [ ]:
df2 = df1.sort_values(by=['Vol','Rev'] , axis=0, ascending=[True,False],  inplace=False)
df2

In [166]:
df2 = df1.sort_values(by='Bangalore_Systems', axis=1, ascending=True, inplace=False)
df2  ##  Error

TypeError: '>' not supported between instances of 'numpy.ndarray' and 'str'

In [ ]:
'abcd' > 'pqrs'

In [ ]:
123 > 456

In [ ]:
123 > 'abc'

In [ ]:
df2 = df1[['Vol','Rev','Exp','EmpCnt']].sort_values(by='Bangalore_Breweries', axis=1, ascending=True, inplace=False)
df2

In [ ]:
df1.select_dtypes(np.number).sort_values(by='Bangalore_Breweries', axis=1, ascending=True, inplace=False)

In [ ]:
df1.select_dtypes(object).sort_values(by='Bangalore_Breweries', axis=1, ascending=True, inplace=False)

In [ ]:
'abcd' > 'pqrs'

In [ ]:
ord('B')

In [ ]:
ord('R')

In [ ]:
ord('l')

In [ ]:
df1.select_dtypes(np.int64)

In [167]:
df1[["EmpCnt", "Rev"]].sort_values(by="Bangalore_Systems", axis=1)

                       Rev  EmpCnt
Kolkata_FMCG         874.4    1379
NCR_Leagles          863.5    1935
Bombay_Sporting      839.8     154
Bombay_Finance       917.0    1443
Bangalore_Systems    881.6    1361
Chennai_Shipping     821.0    1154
Bangalore_Breweries  805.0     119
Chennai_Chemicals    863.2    1656
Indi_Services        733.0   13023

# Ranking

In [ ]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

In [ ]:
df1['Volrank'] = df1.Vol.rank(axis=0,method='average', ascending=False)

In [ ]:
df1

In [ ]:
df1['Volrank'] = df1.Vol.rank(axis=0,method='dense', ascending=False)
df1

In [ ]:
df1['Volrank'] = df1.Vol.rank(axis=0,method='min', ascending=False)
df1

In [ ]:
df1['Volrank'] = df1.Vol.rank(axis=0,method='max', ascending=False)
df1

In [ ]:
df1['Volrank'] = df1.Vol.rank(axis=0,method='first', ascending=False)
df1

read/write from/to difference file formats

In [ ]:
df1

In [ ]:
df1.to_csv('file.csv')

In [ ]:
df1.to_json('file.json')

In [ ]:
df1.to_excel('file.xlsx')

In [ ]:
df1.to_html('file.html')

In [ ]:
df2 = pd.read_csv('file.csv')
df2

In [ ]:
df2 = pd.read_csv('file.csv', index_col=0)
df2

In [ ]:
df2 = pd.read_excel('file.xlsx', index_col=0)
df2

In [ ]:
df2 = pd.read_json('file.json')
df2

In [ ]:
listofdf = pd.read_html('file.html', index_col=0)
listofdf[0]

In [ ]:
listofdf[0]

# Drops

In [ ]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

In [ ]:
df2 = df1.drop(columns='Vol')
df2

In [ ]:
df2 = df1.drop(columns=['Vol','HQ','GST'])
df2

In [ ]:
df2 = df1.drop(columns=['Vol','HQ','GST'], index=['Bombay_Sporting', 'Bangalore_Breweries'])
df2

In [ ]:
df2 = df1.drop(inplace=True, columns=['Vol','HQ','GST'], index=['Bombay_Sporting', 'Bangalore_Breweries'])
df2

In [ ]:
df1

In [ ]:
df2 = df1.drop(columns="Rev")

In [ ]:
df2

In [ ]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

In [ ]:
df1.drop(labels='Vol', axis=1)

In [ ]:
df1.drop(labels=['Vol','HQ'], axis=1)

In [ ]:
df1.drop(labels=['Bombay_Finance','Chennai_Shipping'], axis=0)

In [ ]:
np.dsplit(n8_12,4)

dsplit

In [ ]:
n4_8_24 = np.arange(4*8*24).reshape(4,8,24)
print(n4_8_24.shape)

print()

n = np.dsplit(n4_8_24,4)
print(len(n))

print()

print(n[0].shape)

print(n[0])

# 25-Aug-2021.  Pandas

# Pivot Table

In [ ]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

In [ ]:
dfp = pd.pivot_table(df1, index='Sector', aggfunc='mean')
dfp

In [ ]:
dfp = pd.pivot_table(df1, index='Sector', aggfunc='max')
dfp

In [ ]:
dfp = pd.pivot_table(df1, index='Sector', aggfunc='min')
dfp

In [ ]:
dfp = pd.pivot_table(df1, index='Sector', aggfunc=np.min)
dfp

In [ ]:
dfp = pd.pivot_table(df1, index='Sector', aggfunc=[np.min,np.max, np.mean])
dfp

In [ ]:
dfp = pd.pivot_table(df1, index='Sector', values=['Rev','Vol'],aggfunc=[np.min,np.max, np.mean])
dfp

In [ ]:
dfp = pd.pivot_table(df1, index=['Sector','GST'], values=['Rev','Vol'],aggfunc=['count',np.min,np.max, np.mean])
dfp

In [ ]:
dfp = pd.pivot_table(df1, index=['Sector'], columns='GST',values=['Rev','Vol'],aggfunc=['count',np.mean])
dfp

In [ ]:
pd.pivot_table(df1, index = 'HQ', values = ['Rev','Exp'], aggfunc=np.max)

In [ ]:
dfp = pd.pivot_table(df1, index='Sector' ,values='Vol',aggfunc=[np.max,np.min])
dfp

In [ ]:
def diffmaxmin(ps1):
    #print(ps1)
    #print()
    d = ps1.max() - ps1.min()
    return d

In [ ]:
dfp = pd.pivot_table(df1, index='Sector' ,values='Vol',aggfunc=[np.max,np.min,diffmaxmin])
dfp

In [ ]:
df1.loc[df1.Sector=='Gov','Vol']

In [ ]:
dfp = pd.pivot_table(df1, index='Sector' ,values=['Vol','Rev'],aggfunc=[np.max,np.min,diffmaxmin])
dfp

# Groupby

In [ ]:
df1

In [ ]:
dfg = df1.groupby(by='Sector')
print(type(dfg))
print(dfg)

In [ ]:
list(dfg)

In [ ]:
for item in dfg:
    print(type(item))
    print(item)
    print()

In [ ]:
dfglist = list(dfg)
dfglist[0]

In [ ]:
print(dfglist[2][0])
print(dfglist[2][1])

In [ ]:
dfglist[0][1]

In [ ]:
pd.set_option('display.width',100)

In [174]:
df1.groupby(by='Sector').mean()

C:\Users\dhili\AppData\Local\Temp\ipykernel_28184\2334218767.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df1.groupby(by='Sector').mean()

          Vol     Rev    Exp  EmpCnt  MNC  gvolrank
Sector
Gov     927.0  807.30  629.5  7192.0  0.0       1.5
Pub     942.6  867.82  645.6  1513.4  0.6       3.0
Pvt     948.5  822.40  755.0   136.5  0.5       1.5

In [175]:
df1.groupby(by='Sector').max()

        Vol    Rev  Exp  EmpCnt   HQ  MNC StockID       GST   Started  gvolrank
Sector
Gov     954  881.6  650   13023  NCR    0    INDI  Services  Mar 1920       2.0
Pub     992  917.0  676    1935  NCR    1    SHIP  Services  Nov 1930       5.0
Pvt     966  839.8  895     154  Mum    1    SPRT  Services  Oct 1971       2.0

In [176]:
df1.groupby(by='Sector').max()['Vol']

Sector
Gov    954
Pub    992
Pvt    966
Name: Vol, dtype: int64

In [177]:
df1.groupby(by='Sector')['Vol'].max()

Sector
Gov    954
Pub    992
Pvt    966
Name: Vol, dtype: int64

In [178]:
df1.groupby(by='Sector')['Vol'].agg('max')

Sector
Gov    954
Pub    992
Pvt    966
Name: Vol, dtype: int64

In [179]:
df1.groupby(by='Sector')['Vol'].agg(['max','min'])

        max  min
Sector
Gov     954  900
Pub     992  899
Pvt     966  931

In [180]:
df1.groupby(by='Sector')['Vol'].agg(['max','min', np.mean])

        max  min   mean
Sector
Gov     954  900  927.0
Pub     992  899  942.6
Pvt     966  931  948.5

In [181]:
df1.groupby(by='Sector').agg(['max','min', np.mean])

C:\Users\dhili\AppData\Local\Temp\ipykernel_28184\2516234217.py:1: FutureWarning: ['HQ', 'StockID', 'GST', 'Started'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df1.groupby(by='Sector').agg(['max','min', np.mean])

        Vol                Rev                 Exp             EmpCnt               MNC           \
        max  min   mean    max    min    mean  max  min   mean    max   min    mean max min mean
Sector
Gov     954  900  927.0  881.6  733.0  807.30  650  609  629.5  13023  1361  7192.0   0   0  0.0
Pub     992  899  942.6  917.0  821.0  867.82  676  605  645.6   1935  1154  1513.4   1   0  0.6
Pvt     966  931  948.5  839.8  805.0  822.40  895  615  755.0    154   119   136.5   1   0  0.5

       gvolrank
            max  min mean
Sector
Gov         2.0  1.0  1.5
Pub         5.0  1.0  3.0
Pvt         2.0  1.0  1.5

In [182]:
df1.groupby(by='Sector').agg(['max','min', diffmaxmin])

NameError: name 'diffmaxmin' is not defined

In [183]:
df1.groupby(by=['Sector','GST']).agg(['max','min', diffmaxmin])

NameError: name 'diffmaxmin' is not defined

In [184]:
df1.groupby(by=['Sector','GST'])['Vol'].agg(['max','min', diffmaxmin])

NameError: name 'diffmaxmin' is not defined

In [185]:
df1['gvolrank'] = df1.groupby(by='Sector')['Vol'].rank()

In [186]:
df1.groupby(by='Sector')['Vol'].max()

Sector
Gov    954
Pub    992
Pvt    966
Name: Vol, dtype: int64

In [187]:
df1.groupby(by='Sector')['Vol'].apply(max)

Sector
Gov    954
Pub    992
Pvt    966
Name: Vol, dtype: int64

# Crosstab

In [188]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,gvolrank
Kolkata_FMCG,925,874.4,676,Pub,1379,Kol,1,KFMC,Goods,Jan 1920,2.0
NCR_Leagles,931,863.5,605,Pub,1935,NCR,0,NCRL,Services,Feb 1960,3.0
Bombay_Sporting,931,839.8,615,Pvt,154,Mum,0,SPRT,Services,Mar 1943,1.0
Bombay_Finance,899,917.0,674,Pub,1443,Mum,0,BFIN,Services,Apr 1925,1.0
Bangalore_Systems,900,881.6,650,Gov,1361,Blr,0,BSYS,Services,Apr 1950,1.0
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1,SHIP,Services,Nov 1930,5.0
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,1,BREW,Goods,Oct 1971,2.0
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,1,CHEM,Goods,Aug 1928,4.0
Indi_Services,954,733.0,609,Gov,13023,NCR,0,INDI,Services,Mar 1920,2.0

In [ ]:
pd.crosstab(df1.Sector, df1.GST)

In [ ]:
pd.crosstab(df1.Sector, df1.GST, values=df1.Vol, aggfunc='mean')

In [ ]:
## pd.crosstab(df1.Sector, df1.GST, values=[df1.Vol,df1.Rev],aggfunc=['mean','min']) ## ERROR

# Map

In [ ]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

In [ ]:
md1 = {'Kol': 'EZ', 'Mum':'WZ', 'NCR':'NZ', 'Che':'SZ', 'Blr':'SZ'}

In [ ]:
df1['Zone'] = df1.HQ.map(md1)

In [ ]:
df1

In [ ]:
##  > 950: 'Excellent Perforamnce, < 930: 'Average  ... 'Good'

In [ ]:
def sales_performance(sales_value):
    if sales_value > 950:
        return 'ExcellentSales'
    elif sales_value < 930:
        return 'AverageSales'
    else:
        return 'GoodSales'

In [ ]:
df1['Sales_Performance'] = df1.Vol.map(sales_performance)
df1

# Rename  of Labels

In [189]:
df1 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds1.csv')
df1

                     Vol    Rev  Exp Sector  EmpCnt   HQ  MNC StockID       GST   Started
Kolkata_FMCG         925  874.4  676    Pub    1379  Kol    1    KFMC     Goods  Jan 1920
NCR_Leagles          931  863.5  605    Pub    1935  NCR    0    NCRL  Services  Feb 1960
Bombay_Sporting      931  839.8  615    Pvt     154  Mum    0    SPRT  Services  Mar 1943
Bombay_Finance       899  917.0  674    Pub    1443  Mum    0    BFIN  Services  Apr 1925
Bangalore_Systems    900  881.6  650    Gov    1361  Blr    0    BSYS  Services  Apr 1950
Chennai_Shipping     992  821.0  665    Pub    1154  Che    1    SHIP  Services  Nov 1930
Bangalore_Breweries  966  805.0  895    Pvt     119  Blr    1    BREW     Goods  Oct 1971
Chennai_Chemicals    966  863.2  608    Pub    1656  Che    1    CHEM     Goods  Aug 1928
Indi_Services        954  733.0  609    Gov   13023  NCR    0    INDI  Services  Mar 1920

In [190]:
df2 = df1.rename(index={'Bangalore_Breweries':'UB','Indi_Services':'IR' }, columns={'Vol':'Volume', 'Rev':'Revenue'})
df2

                   Volume  Revenue  Exp Sector  EmpCnt   HQ  MNC StockID       GST   Started
Kolkata_FMCG          925    874.4  676    Pub    1379  Kol    1    KFMC     Goods  Jan 1920
NCR_Leagles           931    863.5  605    Pub    1935  NCR    0    NCRL  Services  Feb 1960
Bombay_Sporting       931    839.8  615    Pvt     154  Mum    0    SPRT  Services  Mar 1943
Bombay_Finance        899    917.0  674    Pub    1443  Mum    0    BFIN  Services  Apr 1925
Bangalore_Systems     900    881.6  650    Gov    1361  Blr    0    BSYS  Services  Apr 1950
Chennai_Shipping      992    821.0  665    Pub    1154  Che    1    SHIP  Services  Nov 1930
UB                    966    805.0  895    Pvt     119  Blr    1    BREW     Goods  Oct 1971
Chennai_Chemicals     966    863.2  608    Pub    1656  Che    1    CHEM     Goods  Aug 1928
IR                    954    733.0  609    Gov   13023  NCR    0    INDI  Services  Mar 1920

In [ ]:
df1

# Replace  Values

In [ ]:
df1

In [ ]:
df1.Sector.replace('Pub','Public', inplace=True)
df1

In [ ]:
md1 = {'Kol': 'EZ', 'Mum':'WZ', 'NCR':'NZ', 'Che':'SZ', 'Blr':'SZ'}
df1.HQ.replace(md1, inplace=True)
df1

# Handling Missing Data

In [ ]:
df0 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds0.csv')
df0

In [ ]:
df0.shape

In [ ]:
df0.info()

In [ ]:
df0

In [ ]:
df0.isnull()

In [ ]:
df0.isnull().sum()

In [ ]:
df0.Rev.isnull()

In [ ]:
df0[df0.Rev.isnull()]

In [ ]:
df0

In [ ]:
df0.dropna()

In [ ]:
df0.dropna().info()

In [ ]:
df0

In [ ]:
df0.Rev

In [ ]:
df0.fillna(999)

In [ ]:
df0

In [ ]:
df0.Rev

In [ ]:
df0.Rev.fillna(800)

In [ ]:
df0.Rev

In [ ]:
df0.Rev.mean()

In [ ]:
df0.Rev.fillna(df0.Rev.mean(), inplace=True)

In [ ]:
df0

In [ ]:
df0.EmpCnt.fillna(df0.EmpCnt.mean(), inplace=False)

In [ ]:
df0.EmpCnt.median()

In [ ]:
df0.EmpCnt.skew()

In [ ]:
df0.EmpCnt.fillna(df0.EmpCnt.median(), inplace=True)

In [ ]:
df0

In [ ]:
df0.Sector.fillna(method='ffill')

In [ ]:
df0.Sector.fillna(method='bfill')

In [ ]:
df0

In [ ]:
df0.EmpCnt.kurt()

# MultiLevel Indexed DataFrame

                      2019  2019 2020  2020
                      Q1    Q2   Q1    Q2
Tata   FMCG
Tata   Tech
Birla  FMCG
Birla  Tech
Wipro  FMCG
Wipro  Tech
ITC    FMCG
ITC    Tech

In [ ]:
np.random.seed(23)
n84 = np.random.randint(low=10, high=100, size=(8,4))
n84

In [ ]:
row_labels_level0 = ['Tata','Birla','Wipro','ITC']
row_labels_level1 = ['FMCG','Tech']

col_labels_level0 = [2019,2020]
col_labels_level1 = ['Q1', 'Q2']

In [ ]:
row_labels = pd.MultiIndex.from_product([row_labels_level0, row_labels_level1])
row_labels

In [ ]:
col_labels = pd.MultiIndex.from_product([col_labels_level0, col_labels_level1])
col_labels

In [ ]:
df1 = pd.DataFrame(n84,  index=row_labels, columns=col_labels)
df1

In [ ]:
df1.index

In [ ]:
df1.columns

In [ ]:
df1

In [ ]:
df1.loc[('Birla', 'Tech'),  (2020, 'Q1')]

# Stack-Unstack

In [ ]:
df1

In [ ]:
df1.columns.levels

In [ ]:
df1.index.levels

In [ ]:
df1

In [ ]:
df2 = df1.stack(level=-1)
df2

In [ ]:
df2.unstack(level=0)

In [ ]:
df1

              tata birla
              q1 q2
2019  fmcg
2020  tech

In [ ]:
df1.stack(level=0).unstack(level=0).stack(level=0).unstack(level=-1).unstack(level=0).stack(level=-1)

In [ ]:
df1.stack(level=0).unstack(level=0).stack(level=0).unstack(level=[-1,0]).stack(level=-1)

In [ ]:
df1.stack(level = 0).stack(level = 0).unstack(level = 0).unstack(level = 2)

# Concatenation

In [ ]:
df11 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds11.csv')
df11

In [ ]:
df12 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds12.csv')
df12

In [ ]:
print(df11)
print()
print(df12)
dfc = pd.concat(objs=(df11,df12), axis=0, join='outer', keys=None)
dfc

In [ ]:
print(df11)
print()
print(df12)
dfc = pd.concat(objs=(df11,df12), axis=0, join='inner', keys=None)
dfc

In [ ]:
dfc.loc['Bombay_Sporting']

In [ ]:
print(df11)
print()
print(df12)
dfc = pd.concat(objs=(df11,df12), axis=0, join='inner', keys=['q1', 'q2'])
dfc

In [ ]:
dfc.index

In [ ]:
dfc.columns

In [ ]:
dfc.loc[('q2',   'Bombay_Sporting'), 'Exp']

In [ ]:
print(df11)
print()
print(df12)
dfc = pd.concat(objs=(df11,df12), axis=1, join='inner', keys=['q1', 'q2'])
dfc

In [ ]:
print(df11)
print()
print(df12)
dfc = pd.concat(objs=(df11,df12), axis=1, join='outer', keys=['q1', 'q2'])
dfc

# Merging

In [ ]:
df21 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds21.csv')
df21

In [ ]:
df22 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds22.csv')
df22

In [ ]:
df23 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds23.csv')
df23

In [ ]:
dfm = pd.merge(df21,df22, on='HQ', how='inner', indicator=True)
dfm

In [ ]:
dfm = pd.merge(df21,df22, on='HQ', how='outer', indicator=True)
dfm

In [ ]:
dfm = pd.merge(df21,df22, on='HQ', how='left', indicator=True)
dfm

In [ ]:
dfm = pd.merge(df21,df22, on='HQ', how='right', indicator=True)
dfm

In [ ]:
dfm = pd.merge(df21,df23, on='HQ', how='inner', indicator=True)
dfm

In [ ]:
dfm = pd.merge(df23,df23, on='HQ', how='inner', indicator=True)
dfm

In [ ]:
print(df21)
print()
print(df22)
print()
print(df23)
print()

In [ ]:
dfm = pd.merge(df21,df22, left_on='stock_id', right_on='stock_name', how='inner', suffixes=['_left', '_right'] ,indicator=True)
dfm

In [ ]:
dfm = pd.merge(df21,df22, left_on='stock_id', right_on='stock_name', how='outer', suffixes=['_left', '_right'] ,indicator=True)
dfm

In [ ]:
dfm = pd.merge(df21,df22, how='cross', indicator=True)
dfm

# Duplicate Handling

In [ ]:
df33 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds33.csv')
df33

In [ ]:
df33.duplicated(subset=None, keep='first')

In [ ]:
df33.duplicated(subset=None, keep='last')

In [ ]:
df33.duplicated(subset=None, keep=False)

In [ ]:
df33.duplicated(subset=['City', 'Temperature'], keep=False)

In [ ]:
df33.duplicated(subset=['City', 'Temperature'], keep='first')

In [ ]:
df33[df33.duplicated(subset=['City', 'Temperature'], keep='first')]

In [ ]:
df33.drop_duplicates(keep='first', subset=None)

In [ ]:
df33.drop_duplicates(keep='last', subset=None)

In [ ]:
df33.drop_duplicates(keep='last', subset=['City','Humidity'])

# Melting

In [ ]:
df31 = pd.read_csv('https://raw.githubusercontent.com/vcsgithub/vcsgithub.github.io/master/lds31.csv')
df31

In [ ]:
pd.melt(frame=df31, id_vars=['Location', 'Temperature'])

In [ ]:
print(df31)
pd.melt(frame=df31, id_vars=['Location', 'Temperature'], var_name='melted_col_names', value_name='melted_col_values')

In [ ]:
print(df31)
pd.melt(frame=df31, id_vars=['Location', 'Temperature'], value_vars=['Feb2019', 'Mar2019'], var_name='melted_col_names', value_name='melted_col_values')

In [ ]:
df1 = pd.DataFrame(n84,  index=row_labels, columns=col_labels)
df1

In [ ]:
pd.melt(df1, id_vars=[(2019,'Q1')],col_level=None)

In [ ]:
pd.melt(df1, id_vars=[(2019,'Q1')],col_level=1)